English/Western Civilization/12 Michelangelo's Creation of Adam on the Sistine Chapel ceiling.org
#+OPTIONS: \n:t toc:nil num:nil html-postamble:nil
#+HTML_HEAD_EXTRA: <style>body {background: rgb(193, 230, 198) !important;}</style>
* 12 Michelangelo's Creation of Adam on the Sistine Chapel ceiling
#+begin_verse
Were the fourteenth and fifteenth centuries a continuation of the Middle Ages
	or the beginning of a new era?
The answer is that both positions are true.
Although the disintegrative patterns of the fourteenth century continued into the fifteenth,
	at the same time there were elements of recovery
		that made the fifteenth century
			a period of significant political, economic, artistic, and intellectual change.
The humanists or intellectuals of the age
	considered their period (from the mid-fourteenth to the mid-sixteenth century) an age of rebirth,
	believing that they had restored arts and letters to new glory
		after they had been neglected or dead for centuries.
The humanists also saw their age as one of accomplished individuals
	who dominated the landscape of their time.
Michelangelo, the great Italian artist of the early sixteenth century,
	and Pope Julius II, the warrior pope, were two such titans.
The artist's temperament and the pope's temper
	led to many lengthy and often loud quarrels between the two.
Among other commissions,
	the pope had hired Michelangelo to paint the ceiling of the Sistine Chapel in Rome,
	a daunting task for a man long accustomed to being a sculptor.
Michelangelo undertook the project
	but refused for a long time to allow anyone, including the pope, to see his work.
Julius grew anxious,
	pestering Michelangelo on a regular basis about when the ceiling would be finished.
Exasperated by the pope's requests,
	Michelangelo once replied, according to Giorgio Vasari, his contemporary biographer,
		that the ceiling would be completed 'when it satisfies me as an artist.'
The pope responded,	'And we want you to satisfy us and finish it soon,'
	and then threatened that if Michelangelo did not finish the ceiling quickly
		the pope would have him thrown down from the scaffolding.
Fearing the pope's anger,
	Michelangelo lost no time in doing all that was wanted and quickly completed the ceiling,
		one of the great masterpieces of Western art.

The humanists' view of their age as
		a rebirth of the Classical civilization of the Greeks and Romans
	ultimately led historians to use the French word Renaissance to identify this age.
Although recent historians have emphasized the many elements of continuity
		between the Middle Ages and the Renaissance,
	the latter age was also distinguished by its own unique characteristics.
#+end_verse
** expression
continuation [kənˌtɪnjuˈeɪʃ(ə)n]: n. something that continues or follows something else that has happened before, without a stop or change延续
position [pəˈzɪʃ(ə)n]: n. the situation that someone is in, especially when this affects what they can and cannot do立场,位置
significant [sɪɡˈnɪfɪkənt]: adj. having an important effect or influence, especially on what will happen in the future OPP insignificant有意义的, 重大的, 重要的
humanism [ˈhjuməˌnɪzəm] humanist: n. the belief that human problems can be solved through science rather than religion人本主义
neglect [nəˈɡlekt]: v. to pay too little attention to something忽视, 疏忽
accomplished [əˈkʌmplɪʃt]: adj. an accomplished writer, painter, singer etc is very skilful多才多艺的
landscape [ˈlændˌskeɪp]: n. the political/social landscape the general situation in which a particular activity takes place形势
titan [ˈtaɪt(ə)n]: n. a very strong or important person SYN giant巨人
temperament [ˈtemp(ə)rəmənt]: n. the emotional part of someone’s character, especially how likely they are to be happy, angry etc气质
lengthy [ˈleŋθi]: adj. continuing for a long time, often too long OPP brief冗长的, 过分的
commission [kəˈmɪʃ(ə)n]: n. a request for an artist, designer, or musician to make a piece of art or music, for which they are paid委托
ceiling [ˈsilɪŋ]: n. the inner surface of the top part of a room ⇨ roof天花板
daunting [ˈdɔntɪŋ]: adj. frightening in a way that makes you feel less confident使人畏缩的
exasperate [ɪɡˈzæspəˌreɪt]: v. to make someone very annoyed by continuing to do something that upsets them激怒
biographer [baɪˈɑɡrəfər]: n. someone who writes a biography of someone else传记作者
scaffolding [ˈskæfoʊldɪŋ]: n. a set of poles and boards that are built into a structure for workers to stand on when they are working on the outside of a building脚手架
historian [hɪˈstɔriən]: n. someone who studies history, or the history of a particular thing历史学家
emphasize [ˈemfəˌsaɪz]: v. to say something in a strong way SYN stress强调
distinguish [dɪˈstɪŋɡwɪʃ]: v. to recognize and understand the difference between two or more things or people SYN differentiate区别
--------------------
continue into st.(the future): 持续到未来
restore sth. to new glory: 恢复某事的新荣耀(辉煌)
hire sb. to do sth.: 雇佣某人去做某事
pester sb. about sth.: 纠缠某人某事
on a regular basis: 定期的
sb. threatens that + ...: 某人威胁...
lose no time in doing sth.: 不浪费时间马上做某事
view of A as B: 把A视作为B的观点
