Western Civilization/12 Michelangelo's Creation of Adam on the Sistine Chapel ceiling.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-01-09 Thu 23:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="DESKTOP-13B7HQM" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="outline-container-orga26bbde" class="outline-2">
<h2 id="orga26bbde">12 Michelangelo's Creation of Adam on the Sistine Chapel ceiling</h2>
<div class="outline-text-2" id="text-orga26bbde">
<p class="verse">
Were the fourteenth and fifteenth centuries a continuation of the Middle Ages<br />
&#xa0;or the beginning of a new era?<br />
The answer is that both positions are true.<br />
Although the disintegrative patterns of the fourteenth century continued into the fifteenth,<br />
&#xa0;at the same time there were elements of recovery<br />
&#xa0;&#xa0;that made the fifteenth century<br />
&#xa0;&#xa0;&#xa0;a period of significant political, economic, artistic, and intellectual change.<br />
The humanists or intellectuals of the age<br />
&#xa0;considered their period (from the mid-fourteenth to the mid-sixteenth century) an age of rebirth,<br />
&#xa0;believing that they had restored arts and letters to new glory<br />
&#xa0;&#xa0;after they had been neglected or dead for centuries.<br />
The humanists also saw their age as one of accomplished individuals<br />
&#xa0;who dominated the landscape of their time.<br />
Michelangelo, the great Italian artist of the early sixteenth century,<br />
&#xa0;and Pope Julius II, the warrior pope, were two such titans.<br />
The artist's temperament and the pope's temper<br />
&#xa0;led to many lengthy and often loud quarrels between the two.<br />
Among other commissions,<br />
&#xa0;the pope had hired Michelangelo to paint the ceiling of the Sistine Chapel in Rome,<br />
&#xa0;a daunting task for a man long accustomed to being a sculptor.<br />
Michelangelo undertook the project<br />
&#xa0;but refused for a long time to allow anyone, including the pope, to see his work.<br />
Julius grew anxious,<br />
&#xa0;pestering Michelangelo on a regular basis about when the ceiling would be finished.<br />
Exasperated by the pope's requests,<br />
&#xa0;Michelangelo once replied, according to Giorgio Vasari, his contemporary biographer,<br />
&#xa0;&#xa0;that the ceiling would be completed 'when it satisfies me as an artist.'<br />
The pope responded,	'And we want you to satisfy us and finish it soon,'<br />
&#xa0;and then threatened that if Michelangelo did not finish the ceiling quickly<br />
&#xa0;&#xa0;the pope would have him thrown down from the scaffolding.<br />
Fearing the pope's anger,<br />
&#xa0;Michelangelo lost no time in doing all that was wanted and quickly completed the ceiling,<br />
&#xa0;&#xa0;one of the great masterpieces of Western art.<br />
<br />
The humanists' view of their age as<br />
&#xa0;&#xa0;a rebirth of the Classical civilization of the Greeks and Romans<br />
&#xa0;ultimately led historians to use the French word Renaissance to identify this age.<br />
Although recent historians have emphasized the many elements of continuity<br />
&#xa0;&#xa0;between the Middle Ages and the Renaissance,<br />
&#xa0;the latter age was also distinguished by its own unique characteristics.<br />
</p>
</div>
<div id="outline-container-orga904b61" class="outline-3">
<h3 id="orga904b61">expression</h3>
<div class="outline-text-3" id="text-orga904b61">
<p>
continuation [kənˌtɪnjuˈeɪʃ(ə)n]: n. something that continues or follows something else that has happened before, without a stop or change延续<br />
position [pəˈzɪʃ(ə)n]: n. the situation that someone is in, especially when this affects what they can and cannot do立场,位置<br />
significant [sɪɡˈnɪfɪkənt]: adj. having an important effect or influence, especially on what will happen in the future OPP insignificant有意义的, 重大的, 重要的<br />
humanism [ˈhjuməˌnɪzəm] humanist: n. the belief that human problems can be solved through science rather than religion人本主义<br />
neglect [nəˈɡlekt]: v. to pay too little attention to something忽视, 疏忽<br />
accomplished [əˈkʌmplɪʃt]: adj. an accomplished writer, painter, singer etc is very skilful多才多艺的<br />
landscape [ˈlændˌskeɪp]: n. the political/social landscape the general situation in which a particular activity takes place形势<br />
titan [ˈtaɪt(ə)n]: n. a very strong or important person SYN giant巨人<br />
temperament [ˈtemp(ə)rəmənt]: n. the emotional part of someone’s character, especially how likely they are to be happy, angry etc气质<br />
lengthy [ˈleŋθi]: adj. continuing for a long time, often too long OPP brief冗长的, 过分的<br />
commission [kəˈmɪʃ(ə)n]: n. a request for an artist, designer, or musician to make a piece of art or music, for which they are paid委托<br />
ceiling [ˈsilɪŋ]: n. the inner surface of the top part of a room ⇨ roof天花板<br />
daunting [ˈdɔntɪŋ]: adj. frightening in a way that makes you feel less confident使人畏缩的<br />
exasperate [ɪɡˈzæspəˌreɪt]: v. to make someone very annoyed by continuing to do something that upsets them激怒<br />
biographer [baɪˈɑɡrəfər]: n. someone who writes a biography of someone else传记作者<br />
scaffolding [ˈskæfoʊldɪŋ]: n. a set of poles and boards that are built into a structure for workers to stand on when they are working on the outside of a building脚手架<br />
historian [hɪˈstɔriən]: n. someone who studies history, or the history of a particular thing历史学家<br />
emphasize [ˈemfəˌsaɪz]: v. to say something in a strong way SYN stress强调<br />
distinguish [dɪˈstɪŋɡwɪʃ]: v. to recognize and understand the difference between two or more things or people SYN differentiate区别<br />
</p>
<hr />
<p>
continue into st.(the future): 持续到未来<br />
restore sth. to new glory: 恢复某事的新荣耀(辉煌)<br />
hire sb. to do sth.: 雇佣某人去做某事<br />
pester sb. about sth.: 纠缠某人某事<br />
on a regular basis: 定期的<br />
sb. threatens that + &#x2026;: 某人威胁&#x2026;<br />
lose no time in doing sth.: 不浪费时间马上做某事<br />
view of A as B: 把A视作为B的观点<br />
</p>
</div>
</div>
