Western Civilization/12 Michelangelo's Creation of Adam on the Sistine Chapel ceiling.html
<div id="outline-container-orge14f487" class="outline-3">
<h3 id="orge14f487">sentence</h3>
<div class="outline-text-3" id="text-orge14f487">
<p>
continuation: n. something that continues or follows something else that has happened before, without a stop or change延续<br />
</p>
<ul class="org-ul">
<li>The silk industry was seen as the continuation of the clothing industry.<br /></li>
<li>The suburban was said to be the continuation of the great city.<br /></li>
<li>It occurred to me that the island was the continuation of the land.<br /></li>
</ul>
<p>
position: n. the situation that someone is in, especially when this affects what they can and cannot do立场,位置<br />
</p>
<ul class="org-ul">
<li>If I were in your position, I would not accept such stupid criticism.<br /></li>
<li>You'd better not laugh at somebody when you don't know his position.<br /></li>
<li>My position is at line 3, row 5 in the theater.<br /></li>
</ul>
<p>
significant: adj. having an important effect or influence, especially on what will happen in the future OPP insignificant有意义的, 重大的, 重要的<br />
</p>
<ul class="org-ul">
<li>A new machine was used to detect gold proved significant because of subsequent discoveries of buried treasure.<br /></li>
<li>The pope enacted a significant ritual to crown the German king.<br /></li>
<li>The masterpiece is so significant that it exerted tremendous influences on modern arts.<br /></li>
</ul>
<p>
humanism humanist: n. the belief that human problems can be solved through science rather than religion人本主义<br />
</p>
<ul class="org-ul">
<li>It was these humanists who saved us from this pleague, not the church.<br /></li>
<li>The humanist was said to possess a large manor.<br /></li>
<li>The humanist had a good reputation for educating his followers.<br /></li>
</ul>
<p>
neglect: v. to pay too little attention to something忽视, 疏忽<br />
</p>
<ul class="org-ul">
<li>He neglected to do homework so that he could sit in a boat and do nothing at all.<br /></li>
<li>She neglected to feed their cat, which gave rise to the collapse of their marriage.<br /></li>
<li>The notes which you left prevented me from neglecting to do housework.<br /></li>
</ul>
<p>
accomplished: adj. an accomplished writer, painter, singer etc is very skilful多才多艺的<br />
</p>
<ul class="org-ul">
<li>The well-educated experience in his youth makes him an accomplished intellectual.<br /></li>
<li>Beyond doubts, the accomplished intellectual has a skeleton in the cupboard.<br /></li>
<li>The man who won the prize for the best pianist is by no means regarded as an accomplished intellectual.<br /></li>
</ul>
<p>
landscape: n. the political/social landscape the general situation in which a particular activity takes place形势<br />
</p>
<ul class="org-ul">
<li>The embassador was stunned by the political landscape of Europe.<br /></li>
<li>The senator tried to explain the political landscape of their country to people.<br /></li>
<li>The crowds gathered round so that they could communicate to figure out the landscape of their country.<br /></li>
</ul>
<p>
titan: n. a very strong or important person SYN giant大师<br />
</p>
<ul class="org-ul">
<li>The tower named after Mr. Leo who is by no means a titan.<br /></li>
<li>Following his father's footstep, he became a titan in gardening.<br /></li>
<li>Captain, we must rise to 10000 feet so that we could fly over the titan.<br /></li>
</ul>
<p>
temperament: n. the emotional part of someone’s character, especially how likely they are to be happy, angry etc气质<br />
</p>
<ul class="org-ul">
<li>No one could account for the fact that he was blessed with a gentleman's temperament.<br /></li>
<li>Because of the poet's temperament, he never fails to fascinate girls of his own age.<br /></li>
<li>His so-called poet's temperament led to the envy of the pope who confined him in prison for two years.<br /></li>
</ul>
<p>
lengthy: adj. continuing for a long time, often too long OPP brief冗长的, 过分的<br />
</p>
<ul class="org-ul">
<li>It is no use writting such a lengthy article which won't be graded a high score.<br /></li>
<li>I was instructed to write a lengthy letter to my wife in order to celebrate our anniversity.<br /></li>
<li>He has a sense of humor and people won't feel tired of a lengthy story told by him.<br /></li>
</ul>
<p>
commission: n. a request for an artist, designer, or musician to make a piece of art or music, for which they are paid委托<br />
</p>
<ul class="org-ul">
<li>He didn't hesitate to undertake the commission from the college for a god sculpture.<br /></li>
<li>Sensitive to criticism, the humanist refused to undertake another commission for the ceiling paint.<br /></li>
<li>Believe it or not, my husband will undertake the arduous commission for the ring.<br /></li>
</ul>
<p>
ceiling: n. the inner surface of the top part of a room ⇨ roof天花板<br />
</p>
<ul class="org-ul">
<li>As soon as we bought the house, my wife complained about the broken ceiling.<br /></li>
<li>A group of enthusiasm is going to repair the broken ceiling in the chapel.<br /></li>
<li>The light in the ceiling is flashing angry on and off.<br /></li>
</ul>
<p>
daunting: adj. frightening in a way that makes you feel less confident使人畏缩的<br />
</p>
<ul class="org-ul">
<li>The task of crusading states of Muslims is so daunting that our knights got scared.<br /></li>
<li>The arduous journey seems to be daunting.<br /></li>
<li>He mustered up his courage to accept the daunting task.<br /></li>
</ul>
<p>
exasperate: v. to make someone very annoyed by continuing to do something that upsets them激怒<br />
</p>
<ul class="org-ul">
<li>Exasperated by their laughter, he was determined to undertake the arduous task.<br /></li>
<li>Exasparated by the red cap, the bull turned its attention to the drunk and charged at him.<br /></li>
<li>Exasparated by my action, my cat eventually bited me firmly.<br /></li>
</ul>
<p>
biographer: n. someone who writes a biography of someone else传记作者<br />
</p>
<ul class="org-ul">
<li>The biographer was not allowed to take part in the cornation of the emperor.<br /></li>
<li>According his contemporary biographer, the pope assummed political power during the period of the Crusade.<br /></li>
<li>The biographer ordered his men to give up these food sacks.<br /></li>
</ul>
<p>
scaffolding: n. a set of poles and boards that are built into a structure for workers to stand on when they are working on the outside of a building脚手架<br />
</p>
<ul class="org-ul">
<li>He is having an operation, for he fell down from a scaffolding.<br /></li>
<li>It seems daunting to set up such a big scaffolding.<br /></li>
<li>I am expert at setting up big scaffoldings.<br /></li>
</ul>
<p>
historian: n. someone who studies history, or the history of a particular thing历史学家<br />
</p>
<ul class="org-ul">
<li>The historian felt obligated to undertake those arduous translating work.<br /></li>
<li>The translating work is arduous that the historian had to employee several assistants.<br /></li>
<li>The historian was confined to the ring to stand trails for his offsenive words towards the pope.<br /></li>
</ul>
<p>
emphasize: v. to say something in a strong way SYN stress强调<br />
</p>
<ul class="org-ul">
<li>He emphasized that our people was able to surivive the daunting floods.<br /></li>
<li>My wife emphasized that our cat must be fed twice a day.<br /></li>
<li>It is no use emphasizing so many times.<br /></li>
</ul>
<p>
distinguish: v. to recognize and understand the difference between two or more things or people SYN differentiate区别<br />
</p>
<ul class="org-ul">
<li>Obviously, the snake could not distinguish the difference between Indian music and jazz.<br /></li>
<li>This convinced me that our car could distinguish red and blue colors.<br /></li>
<li>It is not necessary to distinguish whether you are white or black in the states.<br /></li>
</ul>
<hr />
<p>
continue into st.(the future): 持续到未来<br />
</p>
<ul class="org-ul">
<li>This is why the incline of trade and industry continued into the thirteenth century.<br /></li>
<li>The papal claims of supermacy over secular authorities continued into the next century.<br /></li>
<li>The lead she took in her class continued into the next semester.<br /></li>
</ul>
<p>
restore sth. to new glory: 恢复某事的新荣耀(辉煌)<br />
</p>
<ul class="org-ul">
<li>The expert felt obligated to restore the zoo to new glory.<br /></li>
<li>He is determined to restore the silk industry to new glory so that he can win a large sum of money.<br /></li>
<li>He restored the monarchical state to new glory in pursuit of his power.<br /></li>
</ul>
<p>
hire sb. to do sth.: 雇佣某人去做某事<br />
</p>
<ul class="org-ul">
<li>Women are not allowed to be hired to do manual work these days.<br /></li>
<li>I hate anyone who hired me to do manual work in such harsher working condition.<br /></li>
<li>He insisted on hiring the ill man to search for the case.<br /></li>
</ul>
<p>
pester sb. about sth.: 纠缠某人某事<br />
</p>
<ul class="org-ul">
<li>My wife never pesters me about diamond which other girls dream of.<br /></li>
<li>I pestered my doctor about when I was allowed to leave hospital.<br /></li>
<li>My cat pestered me on a regular basis about a can which I gave her last week.<br /></li>
</ul>
<p>
on a regular basis: 定期的<br />
</p>
<ul class="org-ul">
<li>The invention of clocks reimined people in the fourteenth century of finishing their work on a regular basis.<br /></li>
<li>Your body should be examined on a regular basis.<br /></li>
<li>I used to feed my cat on a regular basis.<br /></li>
</ul>
<p>
sb. threatens that + &#x2026;: 某人威胁&#x2026;<br />
</p>
<ul class="org-ul">
<li>He threatened that if I didn't give him the key, he would prise the drawer open.<br /></li>
<li>He threatened that he would jump from the building if anyone got close to him.<br /></li>
<li>He threatened that if she dived into the water, he would follow her.<br /></li>
</ul>
<p>
lose no time in doing sth.: 不浪费时间马上做某事<br />
</p>
<ul class="org-ul">
<li>The girl lost no time in catching a flight after the alarm had been given.<br /></li>
<li>The cat lost no time in rushing up to me.<br /></li>
<li>Mrs. Leo lost no time in catching up with these thieves.<br /></li>
</ul>
<p>
view of A as B: 把A视作为B的观点<br />
</p>
<ul class="org-ul">
<li>I admired him for his view of difficulties as chances.<br /></li>
<li>His view of difficulties as chances makes him resilient.<br /></li>
<li>His view of difficulties as chances inspired me to pursue my goal.<br /></li>
</ul>
</div>
</div>
